{
    "userid": {
        "__PAD__": 0,
        "1115242": 1,
        "227368": 2,
        "268502": 3,
        "353405": 4,
        "370363": 5,
        "391781": 6,
        "477708": 7,
        "479339": 8,
        "514836": 9,
        "524548": 10,
        "549940": 11,
        "55033": 12,
        "608569": 13,
        "616268": 14,
        "626053": 15,
        "664542": 16,
        "693616": 17,
        "754948": 18,
        "832981": 19,
        "871665": 20,
        "874257": 21,
        "911194": 22,
        "949173": 23,
        "992364": 24,
        "__OOV__": 25
    },
    "adgroup_id": {
        "__PAD__": 0,
        "117738": 1,
        "118678": 2,
        "148505": 3,
        "158525": 4,
        "164095": 5,
        "168937": 6,
        "169140": 7,
        "170301": 8,
        "172298": 9,
        "192645": 10,
        "194654": 11,
        "214782": 12,
        "223448": 13,
        "225892": 14,
        "261620": 15,
        "263526": 16,
        "27032": 17,
        "318447": 18,
        "320222": 19,
        "323703": 20,
        "339931": 21,
        "361919": 22,
        "362454": 23,
        "366559": 24,
        "383937": 25,
        "395732": 26,
        "415119": 27,
        "41803": 28,
        "431258": 29,
        "444691": 30,
        "452391": 31,
        "454239": 32,
        "467092": 33,
        "472153": 34,
        "473741": 35,
        "477950": 36,
        "506323": 37,
        "512277": 38,
        "513129": 39,
        "519384": 40,
        "530249": 41,
        "530563": 42,
        "537137": 43,
        "540137": 44,
        "541502": 45,
        "545057": 46,
        "54756": 47,
        "553889": 48,
        "561543": 49,
        "570475": 50,
        "570906": 51,
        "571696": 52,
        "572396": 53,
        "573514": 54,
        "576624": 55,
        "588074": 56,
        "594936": 57,
        "595104": 58,
        "596489": 59,
        "601638": 60,
        "604453": 61,
        "605570": 62,
        "620312": 63,
        "627549": 64,
        "633154": 65,
        "636019": 66,
        "636508": 67,
        "646876": 68,
        "651184": 69,
        "654663": 70,
        "659142": 71,
        "662621": 72,
        "663034": 73,
        "674268": 74,
        "675017": 75,
        "677904": 76,
        "679190": 77,
        "680144": 78,
        "681978": 79,
        "687140": 80,
        "690119": 81,
        "696459": 82,
        "698324": 83,
        "702219": 84,
        "703594": 85,
        "713414": 86,
        "722867": 87,
        "726574": 88,
        "734869": 89,
        "742211": 90,
        "756739": 91,
        "758902": 92,
        "789390": 93,
        "87979": 94,
        "__OOV__": 95
    },
    "pid": {
        "__PAD__": 0,
        "430539_1007": 1,
        "430548_1007": 2,
        "__OOV__": 3
    },
    "cate_id": {
        "__PAD__": 0,
        "10876": 1,
        "1226": 2,
        "1535": 3,
        "1665": 4,
        "2201": 5,
        "333": 6,
        "4267": 7,
        "4278": 8,
        "4280": 9,
        "4281": 10,
        "4282": 11,
        "4283": 12,
        "4284": 13,
        "4288": 14,
        "4292": 15,
        "4385": 16,
        "4505": 17,
        "4520": 18,
        "4532": 19,
        "4609": 20,
        "5263": 21,
        "5316": 22,
        "5443": 23,
        "5487": 24,
        "5851": 25,
        "6140": 26,
        "6158": 27,
        "6183": 28,
        "6251": 29,
        "6255": 30,
        "6261": 31,
        "6286": 32,
        "6407": 33,
        "6416": 34,
        "6426": 35,
        "6432": 36,
        "6433": 37,
        "6733": 38,
        "6760": 39,
        "7184": 40,
        "7212": 41,
        "7339": 42,
        "8112": 43,
        "8202": 44,
        "824": 45,
        "9460": 46,
        "9784": 47,
        "__OOV__": 48
    },
    "campaign_id": {
        "__PAD__": 0,
        "101437": 1,
        "102833": 2,
        "107755": 3,
        "112846": 4,
        "113420": 5,
        "115316": 6,
        "119792": 7,
        "122722": 8,
        "133152": 9,
        "133243": 10,
        "137739": 11,
        "138066": 12,
        "138651": 13,
        "142840": 14,
        "143482": 15,
        "144634": 16,
        "14905": 17,
        "150068": 18,
        "153671": 19,
        "155404": 20,
        "155775": 21,
        "156256": 22,
        "158024": 23,
        "160194": 24,
        "166931": 25,
        "17377": 26,
        "175802": 27,
        "181057": 28,
        "183759": 29,
        "184743": 30,
        "187111": 31,
        "188896": 32,
        "192463": 33,
        "200410": 34,
        "202498": 35,
        "223853": 36,
        "225230": 37,
        "225404": 38,
        "230502": 39,
        "234927": 40,
        "237347": 41,
        "237467": 42,
        "239633": 43,
        "241951": 44,
        "244703": 45,
        "246731": 46,
        "252478": 47,
        "254792": 48,
        "256512": 49,
        "259290": 50,
        "264355": 51,
        "265350": 52,
        "274193": 53,
        "286110": 54,
        "292338": 55,
        "302529": 56,
        "330322": 57,
        "345337": 58,
        "345717": 59,
        "346951": 60,
        "347880": 61,
        "348684": 62,
        "349173": 63,
        "35662": 64,
        "360936": 65,
        "363218": 66,
        "364151": 67,
        "366810": 68,
        "369584": 69,
        "381129": 70,
        "384547": 71,
        "385451": 72,
        "386201": 73,
        "38772": 74,
        "393232": 75,
        "394213": 76,
        "397994": 77,
        "398109": 78,
        "398575": 79,
        "399132": 80,
        "408795": 81,
        "419685": 82,
        "419872": 83,
        "421861": 84,
        "44486": 85,
        "57459": 86,
        "59075": 87,
        "6710": 88,
        "67660": 89,
        "76341": 90,
        "76510": 91,
        "84597": 92,
        "8530": 93,
        "87006": 94,
        "93454": 95,
        "94871": 96,
        "95200": 97,
        "__OOV__": 98
    },
    "customer": {
        "__PAD__": 0,
        "103078": 1,
        "109572": 2,
        "117313": 3,
        "11968": 4,
        "119724": 5,
        "120884": 6,
        "1210": 7,
        "124874": 8,
        "13072": 9,
        "131908": 10,
        "132719": 11,
        "135248": 12,
        "13787": 13,
        "144223": 14,
        "14471": 15,
        "149747": 16,
        "151804": 17,
        "155582": 18,
        "155607": 19,
        "156608": 20,
        "157846": 21,
        "162663": 22,
        "164284": 23,
        "171746": 24,
        "171879": 25,
        "172777": 26,
        "173817": 27,
        "179212": 28,
        "179648": 29,
        "1823": 30,
        "182659": 31,
        "183715": 32,
        "184541": 33,
        "185150": 34,
        "186875": 35,
        "189572": 36,
        "19216": 37,
        "195682": 38,
        "205433": 39,
        "20604": 40,
        "214436": 41,
        "215611": 42,
        "21689": 43,
        "217182": 44,
        "222509": 45,
        "223269": 46,
        "224983": 47,
        "228674": 48,
        "22878": 49,
        "232575": 50,
        "238466": 51,
        "239574": 52,
        "24984": 53,
        "252276": 54,
        "25471": 55,
        "254969": 56,
        "25728": 57,
        "25760": 58,
        "27731": 59,
        "28339": 60,
        "3024": 61,
        "32537": 62,
        "33287": 63,
        "343": 64,
        "35990": 65,
        "36888": 66,
        "37031": 67,
        "42812": 68,
        "43184": 69,
        "47076": 70,
        "49079": 71,
        "51721": 72,
        "52598": 73,
        "53778": 74,
        "5406": 75,
        "55297": 76,
        "55729": 77,
        "56774": 78,
        "573": 79,
        "57362": 80,
        "5902": 81,
        "63559": 82,
        "68631": 83,
        "73832": 84,
        "75534": 85,
        "75881": 86,
        "77114": 87,
        "7844": 88,
        "79797": 89,
        "80092": 90,
        "82710": 91,
        "83172": 92,
        "864": 93,
        "88742": 94,
        "94205": 95,
        "96798": 96,
        "__OOV__": 97
    },
    "brand": {
        "__PAD__": 0,
        "106641": 1,
        "106924": 2,
        "11022": 3,
        "137274": 4,
        "139647": 5,
        "141341": 6,
        "144123": 7,
        "156936": 8,
        "158849": 9,
        "160253": 10,
        "166416": 11,
        "166878": 12,
        "180856": 13,
        "186516": 14,
        "194203": 15,
        "194532": 16,
        "197848": 17,
        "206353": 18,
        "215442": 19,
        "220468": 20,
        "234028": 21,
        "247789": 22,
        "255820": 23,
        "259883": 24,
        "270537": 25,
        "290511": 26,
        "291723": 27,
        "293023": 28,
        "302582": 29,
        "304332": 30,
        "30520": 31,
        "3130": 32,
        "314219": 33,
        "314496": 34,
        "317982": 35,
        "321464": 36,
        "327032": 37,
        "337365": 38,
        "339907": 39,
        "364212": 40,
        "388290": 41,
        "389298": 42,
        "395808": 43,
        "40827": 44,
        "409777": 45,
        "418677": 46,
        "41873": 47,
        "420137": 48,
        "424150": 49,
        "42518": 50,
        "425293": 51,
        "42695": 52,
        "455009": 53,
        "53923": 54,
        "54471": 55,
        "58727": 56,
        "59477": 57,
        "65658": 58,
        "73218": 59,
        "80633": 60,
        "87032": 61,
        "89842": 62,
        "90316": 63,
        "95340": 64,
        "98630": 65,
        "__OOV__": 66
    },
    "cms_segid": {
        "__PAD__": 0,
        "0": 1,
        "16": 2,
        "20": 3,
        "33": 4,
        "36": 5,
        "44": 6,
        "57": 7,
        "77": 8,
        "8": 9,
        "__OOV__": 10
    },
    "cms_group_id": {
        "__PAD__": 0,
        "1": 1,
        "10": 2,
        "2": 3,
        "3": 4,
        "4": 5,
        "5": 6,
        "7": 7,
        "8": 8,
        "9": 9,
        "__OOV__": 10
    },
    "final_gender_code": {
        "__PAD__": 0,
        "1": 1,
        "2": 2,
        "__OOV__": 3
    },
    "age_level": {
        "__PAD__": 0,
        "1": 1,
        "2": 2,
        "3": 3,
        "4": 4,
        "5": 5,
        "__OOV__": 6
    },
    "pvalue_level": {
        "__PAD__": 0,
        "1": 1,
        "2": 2,
        "__OOV__": 3
    },
    "shopping_level": {
        "__PAD__": 0,
        "1": 1,
        "2": 2,
        "3": 3,
        "__OOV__": 4
    },
    "occupation": {
        "__PAD__": 0,
        "0": 1,
        "1": 2,
        "__OOV__": 3
    }
}